Model: "batched_policy_with_reup"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
=================================================================
Total params: 84 (672.00 Byte)
Trainable params: 84 (672.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
