Model: "batched_policy_with_reup"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
=================================================================
Total params: 564 (4.41 KB)
Trainable params: 564 (4.41 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
